# Перше завдання

# Замикання в програмуванні - це функція, яка зберігає посилання на змінні зі свого лексичного контексту, тобто з області, де вона була оголошена.
# Реалізуйте функцію caching_fibonacci, яка створює та використовує кеш для зберігання і повторного використання вже обчислених значень чисел Фібоначчі.

# Ряд Фібоначчі - це послідовність чисел виду: 0, 1, 1, 2, 3, 5, 8, ..., де кожне наступне число послідовності виходить додаванням двох попередніх членів ряду.


# Вимоги до завдання:

# Функція caching_fibonacci() повинна повертати внутрішню функцію fibonacci(n).
# fibonacci(n) обчислює n-те число Фібоначчі. Якщо число вже знаходиться у кеші, функція має повертати значення з кешу.
# Якщо число не знаходиться у кеші, функція має обчислити його, зберегти у кеш та повернути результат.
# Використання рекурсії для обчислення чисел Фібоначчі.

# Ось псевдокод для функції caching_fibonacci, яка обчислює числа Фібоначчі з використанням кешування:

#         ФУНКЦІЯ caching_fibonacci
#             Створити порожній словник cache

#             ФУНКЦІЯ fibonacci(n)
#                 Якщо n <= 0, повернути 0
#                 Якщо n == 1, повернути 1
#                 Якщо n у cache, повернути cache[n]

#                 cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
#                 Повернути cache[n]

#             Повернути функцію fibonacci
#         КІНЕЦЬ ФУНКЦІЇ caching_fibonacci


# Функція caching_fibonacci створює внутрішню функцію fibonacci і словник cache для зберігання результатів обчислення чисел Фібоначчі.
# Кожен раз, коли викликається fibonacci(n), спочатку перевіряється, чи вже збережено значення для n у cache.
# Якщо значення є у кеші, воно повертається негайно, що значно зменшує кількість рекурсивних викликів. Якщо значення відсутнє у кеші, воно обчислюється рекурсивно і зберігається у cache.
# Функція caching_fibonacci повертає внутрішню функцію fibonacci, яка тепер може бути використана для обчислення чисел Фібоначчі з використанням кешування.



# Критерії оцінювання:

# Коректність реалізації функції fibonacci(n) з урахуванням використання кешу.
# Ефективне використання рекурсії та кешування для оптимізації обчислень.
# Чистота коду, включаючи читабельність та наявність коментарів.



# Приклад використання:

# # Отримуємо функцію fibonacci
# fib = caching_fibonacci()

# # Використовуємо функцію fibonacci для обчислення чисел Фібоначчі
# print(fib(10))  # Виведе 55
# print(fib(15))  # Виведе 610



# У цьому прикладі, коли ви викликаєте fib(10) або fib(15), функція fibonacci всередині caching_fibonacci обчислює відповідні числа Фібоначчі, зберігаючи попередні результати у кеші.
# Це робить повторні виклики для тих самих значень n значно швидшими, оскільки вони просто повертають значення з кешу.
# Замикання дозволяє fibonacci(n) "пам'ятати" стан cache між різними викликами, що є ключовим для кешування результатів обчислень









def caching_fibonacci(n, cache={}):   

    def fibonacci(n):
        if n <= 0:
            return 0
        if n == 1:
            return 1
        if n in cache:
            return cache[n]
        
        for i in range(1, n + 1):
            if i in cache:
                result = cache[i]
            else:
                result = i * cache.get(i - 1, 1)
                cache[i] = result
                print(f"{i} not in cache {result}")
        return result
    return fibonacci(n)


factirial_3 = caching_fibonacci(3)
print(f"Factorial 3 = {factirial_3}")

factirial_4 = caching_fibonacci(4)
print(f"Factorial 4 = {factirial_4}")

factirial_10 = caching_fibonacci(10)
print(f"Factorial 10 = {factirial_10}")